# Development Principles.

# Принципы разработки (программирования) - набор правил и рекомендаций, который
# помогает программисту писать красивый, понятный и эффективный код.


# DRY, KISS, SSOT, YAGNI

# DRY (Don't Repeat Yourself / не повторяй себя)

# - Не копируй код.
# - Если не получается - декомпозируй.


# KISS (Keep It Simple, Stupid / Keep It Short and Simple / делай проще)

# - Сделай максимально просто.
# - Не усложняй решение задачи, если это не требуется.
# - Не увеличивай бесконечно уровень абстакции.
# - Все намерения должны быть явно видны.


# SSOT (Single Source Of Truth / единый источник правды)

# - Данные должны иметь только один достоверный источник.


# YAGNI (You Ain't Gonna Need It / вам это не пригодится)

# - Не создавай функционал, о котором не просят в поставленной задаче.
# - Не создавай функционал <<на будущее>> - не пригодится.
# - Не создавай функционал <<кому-нибудь пригодится>> - не пригодится.
